{"format": "layers-model", "generatedBy": "keras v2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.18.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_19", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_36"}, "name": "input_36", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_37"}, "name": "input_37", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "model_17", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 12], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_34"}, "name": "input_34", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_169", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_169", "inbound_nodes": [[["input_34", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_171", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_171", "inbound_nodes": [[["dense_169", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense_171", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_172", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_172", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_170", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_170", "inbound_nodes": [[["dense_169", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "name": "add_12", "inbound_nodes": [[["dense_172", 0, 0, {}], ["dense_170", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_174", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_174", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_174", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_175", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_175", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_173", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_173", "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_13", "trainable": true, "dtype": "float32"}, "name": "add_13", "inbound_nodes": [[["dense_175", 0, 0, {}], ["dense_173", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_177", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_177", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["dense_177", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_178", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_178", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_176", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_176", "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_14", "trainable": true, "dtype": "float32"}, "name": "add_14", "inbound_nodes": [[["dense_178", 0, 0, {}], ["dense_176", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_180", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_180", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["dense_180", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_181", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_181", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_179", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_179", "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_15", "trainable": true, "dtype": "float32"}, "name": "add_15", "inbound_nodes": [[["dense_181", 0, 0, {}], ["dense_179", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_183", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_183", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["dense_183", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_184", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_184", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_182", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_182", "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_16", "trainable": true, "dtype": "float32"}, "name": "add_16", "inbound_nodes": [[["dense_184", 0, 0, {}], ["dense_182", 0, 0, {}]]]}], "input_layers": [["input_34", 0, 0]], "output_layers": [["add_16", 0, 0]]}, "name": "model_17", "inbound_nodes": [[["input_36", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "model_18", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 11], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_35"}, "name": "input_35", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_185", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_185", "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_187", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_187", "inbound_nodes": [[["dense_185", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["dense_187", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_188", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_188", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_186", "trainable": true, "dtype": "float32", "units": 1024, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_186", "inbound_nodes": [[["dense_185", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_17", "trainable": true, "dtype": "float32"}, "name": "add_17", "inbound_nodes": [[["dense_188", 0, 0, {}], ["dense_186", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_190", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_190", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["dense_190", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_191", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_191", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_189", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_189", "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "name": "add_18", "inbound_nodes": [[["dense_191", 0, 0, {}], ["dense_189", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_193", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_193", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["dense_193", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_194", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_194", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_192", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_192", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_19", "trainable": true, "dtype": "float32"}, "name": "add_19", "inbound_nodes": [[["dense_194", 0, 0, {}], ["dense_192", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_196", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_196", "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["dense_196", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_197", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_197", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_195", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_195", "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_20", "trainable": true, "dtype": "float32"}, "name": "add_20", "inbound_nodes": [[["dense_197", 0, 0, {}], ["dense_195", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_199", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_199", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_18", "inbound_nodes": [[["dense_199", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_200", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_200", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_198", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_198", "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_21", "trainable": true, "dtype": "float32"}, "name": "add_21", "inbound_nodes": [[["dense_200", 0, 0, {}], ["dense_198", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["add_21", 0, 0]]}, "name": "model_18", "inbound_nodes": [[["input_37", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.l2_normalize_30", "trainable": true, "dtype": "float32", "function": "math.l2_normalize"}, "name": "tf.math.l2_normalize_30", "inbound_nodes": [["model_17", 1, 0, {"axis": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.l2_normalize_31", "trainable": true, "dtype": "float32", "function": "math.l2_normalize"}, "name": "tf.math.l2_normalize_31", "inbound_nodes": [["model_18", 1, 0, {"axis": 1}]]}, {"class_name": "Dot", "config": {"name": "dot_15", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "dot_15", "inbound_nodes": [[["tf.math.l2_normalize_30", 0, 0, {}], ["tf.math.l2_normalize_31", 0, 0, {}]]]}], "input_layers": [["input_36", 0, 0], ["input_37", 0, 0]], "output_layers": [["dot_15", 0, 0]]}}, "training_config": {"loss": {"class_name": "MeanSquaredError", "config": {"reduction": "auto", "name": "mean_squared_error", "fn": "mean_squared_error"}}, "metrics": [], "loss_weights": null, "sample_weight_mode": null, "weighted_metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "dense_169/kernel", "shape": [12, 1024], "dtype": "float32"}, {"name": "dense_169/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_171/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_171/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [1024], "dtype": "float32"}, {"name": "dense_172/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_172/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_170/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_170/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_174/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_174/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [512], "dtype": "float32"}, {"name": "dense_175/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_175/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_173/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_173/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_177/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_177/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_178/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_178/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_176/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_176/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_180/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_180/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [128], "dtype": "float32"}, {"name": "dense_181/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_181/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_179/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_179/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_183/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_183/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [64], "dtype": "float32"}, {"name": "dense_184/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_184/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_182/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_182/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "dense_185/kernel", "shape": [11, 1024], "dtype": "float32"}, {"name": "dense_185/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_187/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_187/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [1024], "dtype": "float32"}, {"name": "dense_188/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_188/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_186/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_186/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_190/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_190/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [512], "dtype": "float32"}, {"name": "dense_191/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_191/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_189/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_189/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_193/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_193/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "dense_194/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_194/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_192/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_192/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_196/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_196/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [128], "dtype": "float32"}, {"name": "dense_197/kernel", "shape": [128, 128], "dtype": "float32"}, {"name": "dense_197/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_195/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_195/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_199/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_199/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [64], "dtype": "float32"}, {"name": "dense_200/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_200/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_198/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_198/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [64], "dtype": "float32"}]}]}